R3b3lAllianc3/nRF52-ble-lr-demo/central_lr_demo_kit/main.c
        // TODO: "Enable" if-statement if RSSI shuold only be logged when changed.
        //if(rssi_value != p_adv_report->rssi)
        //{
            rssi_value = p_adv_report->rssi;
            if(p_adv_report->primary_phy ==  BLE_GAP_PHY_1MBPS)
            {
              NRF_LOG_INFO("Received ADV report, RSSI %d, phy: 1 Mbps",rssi_value);
            }else if (p_adv_report->primary_phy == BLE_GAP_PHY_CODED )
            {
               NRF_LOG_INFO("Received ADV report, RSSI %d, phy: coded",rssi_value);
            } else {
               NRF_LOG_INFO("Received ADV report, RSSI %d, phy: unknown",rssi_value);
            }
                                                                
            NRF_LOG_INFO("addr %02x:%02x:%02x:%02x:%02x:%02x",
                         p_adv_report->peer_addr.addr[0],
                         p_adv_report->peer_addr.addr[1],
                         p_adv_report->peer_addr.addr[2],
                         p_adv_report->peer_addr.addr[3],
                         p_adv_report->peer_addr.addr[4],
                         p_adv_report->peer_addr.addr[5]
                         );
                
             
        //}  
    }
 

    if((m_scan_type_selected == SELECTION_SCAN_CONN) && (adv_is_connectable==true))
    { 
        // Connect if the received adv_report has the set target "DEVICE_NAME" (sdk_config.h)
         if (!ble_advdata_name_find(p_adv_report->data.p_data,
                                    p_adv_report->data.len,
                                    m_target_periph_name))
         {
             err_code = sd_ble_gap_scan_start(NULL, &m_scan_buffer);
             APP_ERROR_CHECK(err_code);
         
             return;
         }
         
         NRF_LOG_INFO("Device \"%s\" found, sending a connection request.",
                      (uint32_t) m_target_periph_name);
         
         // Stop advertising.
         (void) sd_ble_gap_adv_stop(m_adv_handle);
         
         // Initiate connection.
         m_conn_param.min_conn_interval = CONN_INTERVAL_DEFAULT;
         m_conn_param.max_conn_interval = CONN_INTERVAL_DEFAULT;
         
         if(m_adv_scan_phy_selected == SELECTION_CODED_PHY)
         {
           NRF_LOG_INFO("Connecting on coded phy.");
           err_code = sd_ble_gap_connect(&p_adv_report->peer_addr,
                                           &m_scan_param_coded_phy,
                                           &m_conn_param,
                                           APP_BLE_CONN_CFG_TAG);
           if (err_code != NRF_SUCCESS)
             {
                 NRF_LOG_ERROR("sd_ble_gap_connect() failed: 0x%x.", err_code);
             }
             
         } else // SELECTION_1M_PHY
           
         {
           NRF_LOG_INFO("Connecting on 1Mbps.");
         
            err_code = sd_ble_gap_connect(&p_adv_report->peer_addr,
                                          &m_scan_param_1MBps,
                                          &m_conn_param,
                                          APP_BLE_CONN_CFG_TAG);    
            
         } 
         if (err_code != NRF_SUCCESS)
         {
             NRF_LOG_ERROR("sd_ble_gap_connect() failed: 0x%x.", err_code);
             scan_start();
         }
     } else //m_scan_type_selected == SELECTION_SCAN_NON_CONN
     {
      // Continue scanning
       err_code = sd_ble_gap_scan_start(NULL, &m_scan_buffer);
       APP_ERROR_CHECK(err_code);
         
      return;
     }
}


/**@brief Function for handling BLE_GAP_EVT_CONNECTED events.
 * Save the connection handle and GAP role. 
 * Start RSSI measurements and turn on the LED associated with the "connected state".
 */
static void on_ble_gap_evt_connected(ble_gap_evt_t const * p_gap_evt)
{
    ret_code_t err_code;
    
    m_conn_handle = p_gap_evt->conn_handle;
    m_gap_role    = p_gap_evt->params.connected.role;
    
    if (m_gap_role == BLE_GAP_ROLE_PERIPH)
    {
        NRF_LOG_INFO("Connected as a peripheral. Should not happend.");
    }
    else if (m_gap_role == BLE_GAP_ROLE_CENTRAL)
    {
        NRF_LOG_INFO("Connected as a central.");
    }
    
    // Stop scanning.
    (void) sd_ble_gap_scan_stop();
     err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, m_conn_handle, m_output_power_selected);
     APP_ERROR_CHECK(err_code);
    
    bsp_board_led_off(SCAN_LED);
    bsp_board_led_on(ADV_REPORT_LED);

    rssi_measurements_start();

   
}


/**@brief Function for handling BLE_GAP_EVT_DISCONNECTED events.
 * Unset the connection handle and restart scanning if needed.
 */
static void on_ble_gap_evt_disconnected(ble_gap_evt_t const * p_gap_evt)
{
    m_conn_handle = BLE_CONN_HANDLE_INVALID;
    m_waiting_for_disconnect_evt = false;

    NRF_LOG_DEBUG("Disconnected: reason 0x%x.", p_gap_evt->params.disconnected.reason);

    
    if(m_app_initiated_disconnect == false)  // (If a the app itself (button push) has initiated a disconnect, bsp_evt_handler will start the scanning.)
    {
      bsp_board_leds_off();
      set_current_scan_params_and_start_scanning();
    }
    

}


/**@brief Function for handling BLE Stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    static int8_t              rssi_value = 0;
    uint8_t                    channel_rssi;
    uint32_t              err_code;
    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_ADV_REPORT:
            on_adv_report(&p_gap_evt->params.adv_report);
            break;
        
        case BLE_GAP_EVT_CONNECTED:
            on_ble_gap_evt_connected(p_gap_evt);
            break;
        
        case BLE_GAP_EVT_DISCONNECTED:
            on_ble_gap_evt_disconnected(p_gap_evt);
            break;
        
        case BLE_GAP_EVT_CONN_PARAM_UPDATE:
        {
            
            NRF_LOG_INFO("Connection interval updated: 0x%x, 0x%x.",
                p_gap_evt->params.conn_param_update.conn_params.min_conn_interval,
                p_gap_evt->params.conn_param_update.conn_params.max_conn_interval);
        } break;
        
        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
        {
            // Accept parameters requested by the peer.
            ble_gap_conn_params_t params;
            params = p_gap_evt->params.conn_param_update_request.conn_params;
            err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle, &params);
            APP_ERROR_CHECK(err_code);
        
