R3b3lAllianc3/nRF52-ble-lr-demo/central_lr_demo_kit/main.c
    nrf_gpio_cfg_output(PIN_EVENTS_END);
    nrf_gpio_cfg_output(PIN_EVENTS_CRC_OK);
    nrf_gpio_cfg_output(PIN_EVENTS_CRC_ERROR);
    nrf_gpio_cfg_output(PIN_EVENTS_READY);
        
    gpiote_out_init(GPIO_CH0, PIN_EVENTS_END, GPIOTE_CONFIG_POLARITY_Toggle, GPIOTE_CONFIG_OUTINIT_Low); // end
    gpiote_out_init(GPIO_CH1, PIN_EVENTS_CRC_OK, GPIOTE_CONFIG_POLARITY_Toggle, GPIOTE_CONFIG_OUTINIT_Low); // crc ok
    gpiote_out_init(GPIO_CH2, PIN_EVENTS_CRC_ERROR, GPIOTE_CONFIG_POLARITY_Toggle, GPIOTE_CONFIG_OUTINIT_Low); // crc error
    gpiote_out_init(GPIO_CH3, PIN_EVENTS_READY, GPIOTE_CONFIG_POLARITY_Toggle, GPIOTE_CONFIG_OUTINIT_Low); // events ready
        
    NRF_PPI->CH[PPI_CH0].EEP = (uint32_t) &(NRF_RADIO->EVENTS_END);
    NRF_PPI->CH[PPI_CH0].TEP = (uint32_t) &(NRF_GPIOTE->TASKS_OUT[GPIO_CH0]);

    NRF_PPI->CH[PPI_CH1].EEP = (uint32_t) &(NRF_RADIO->EVENTS_CRCOK);
    NRF_PPI->CH[PPI_CH1].TEP = (uint32_t) &(NRF_GPIOTE->TASKS_OUT[GPIO_CH1]);

    NRF_PPI->CH[PPI_CH2].EEP = (uint32_t) &(NRF_RADIO->EVENTS_CRCERROR);
    NRF_PPI->CH[PPI_CH2].TEP = (uint32_t) &(NRF_GPIOTE->TASKS_OUT[GPIO_CH2]);
               
    NRF_PPI->CH[PPI_CH3].EEP = (uint32_t) &(NRF_RADIO->EVENTS_READY);
    NRF_PPI->CH[PPI_CH3].TEP = (uint32_t) &(NRF_GPIOTE->TASKS_OUT[GPIO_CH3]);
    
    //MQ  Fork the EEP into into TEP for triggering counter in Timer
    //NRF_PPI->FORK[PPI_CH3].TEP = (uint32_t) &(NRF_TIMER1->TASKS_COUNT);
    NVIC_DisableIRQ(GPIOTE_IRQn);
    NVIC_ClearPendingIRQ(GPIOTE_IRQn);

    NRF_GPIOTE->INTENSET = (1<<GPIO_CH0)|(1<<GPIO_CH1)|(1<<GPIO_CH2)|(1<<GPIO_CH3); // enable interrupts for config[n] pins

    //NVIC_SetPriority(GPIOTE_IRQn, 3); //optional: set priority of interrupt
    NVIC_EnableIRQ(GPIOTE_IRQn); 

    NRF_PPI->CHENSET = (1 << PPI_CH0) | (1 << PPI_CH1) | (1 << PPI_CH2) | (1 << PPI_CH3);    
}


int main(void)
{
    uint32_t err_code;
    // Initialize.
    log_init();
  
    timer_init();
    buttons_leds_init();
    //MQ 7/11/18
    timer1_init();
    init_ppi();

    power_management_init();
    ble_stack_init();
    gap_params_init();

    // Start execution.
   
    NRF_LOG_INFO("Long range demo  --central--");
    instructions_print();

    set_current_scan_params_and_start_scanning();

    // Start the timer for the LOG module
    err_code = app_timer_start(m_time_keeper_timer_id, SLOW_BLINK_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
